Updated factory page to use mermaid for UML diagrams
